{"tag_name":"v21.02","name":"Rumusan Pokok IDM dari Portal IDM Kemendesa","zipball_url":"https:\/\/api.github.com\/repos\/OpenSID\/OpenSID\/zipball\/v21.02","tarball_url":"https:\/\/api.github.com\/repos\/OpenSID\/OpenSID\/tarball\/v21.02","body":"![idm](https:\/\/user-images.githubusercontent.com\/57283157\/106381907-88989780-63ee-11eb-9483-1e7a5f5986c5.png)\r\n\r\nDi rilis ini, versi 21.02 tersedia rumusan pokok IDM dari portal IDM Kemendesa. Rilis ini juga berisi perbaikan lain yang diminta Komunitas SID.\r\n\r\nTerima kasih pada Ariandi Ryan Kahfi, Il Ham dan afa28 yang terus berkontribusi.\r\n\r\nLengkapnya, isi rilis versi 21.02 adalah sebagai berikut:\r\n\r\n1. Hapus folder themes\/hadakewa yg tidak diperlukan lagi. [teknis]\r\n2. #3848: Tampilkan Nomor Registrasi di semua daftar inventaris.\r\n3. #3904: Tampilkan luas bangunan di daftar inventaris Konstruksi Dalam Pengerjaan. [bug-fix]\r\n4. #3890: Pengguna operator sekarang dapat mengakses menu Buku Administrasi Desa.\r\n5. #3893: Tambah Status hubungan Anak bagi Kepala Keluarga (perempuan) yang belum menikah.\r\n6. #3891: Sekarang ditampilkan pilihan lengkap tingkat pengguna pada form ubah pengguna Administrator. [bug-fix]\r\n7. #3910: Sekarang RT '-' tidak ditampilkan di daftar RT suatu RW. [bug-fix]\r\n8. #3878: Perbaiki masa berlaku surat permohonan layanan mandiri sesuai pengaturan. [bug-fix]\r\n9. #3922: Sekarang error select2 tidak tampil di console browser. [bug-fix]\r\n10. #3943: Sekarang anggota keluarga dapat melihat kelengkapan dokumen kepala keluarga yg dibagi pada anggota tersebut. [bug-fix]\r\n11. #3916: Sekarang bisa simpan Buku Adminisrasi Desa - Administrasi Umum - Buku Agenda-Surat Keluar. [bug-fix]\r\n12. #3958: Tambahkan berapa kode isian format impor BIP 2016 sesuai yang dikeluarkan Dispenduk. [bug-fix]\r\n13. Mutakhirkan tema natra.\r\n\r\nFitur v20.10-premium yg digabung:\r\n\r\n1. #3512: Sediakan menu mengatur ukuran bagan.\r\n2. #1767: Tambahkan kolom Jabatan dan No SK Jabatan di data Kelompok. Tampilkan daftar Pengurus dan daftar Anggota Kelompok secara terpisah di halaman statis Kelompok di Web.\r\n3. #3531: Tampilkan rumusan pokok IDM di Info Desa > Status Desa dari portal IDM Kemendesa. Dan bisa ditampilkan di Web melalui menu statis.\r\n4. #3571: Sediakan fitur untuk mencetak peta wilayah desa\/dusun\/rw\/rt.\r\n5. #2775: Sediakan Buku Lembaran dan Berita Desa.\r\n\r\n\r\nSelalu diingatkan, apabila meng-upgrade (yaitu bukan install baru) dari versi SEBELUM versi 21.02, lakukan Database > Migrasi DB untuk menyesuaikan struktur database dan folder desa.","created_at":"2021-01-31T22:15:51Z","published_at":"2021-01-31T22:22:43Z"}